Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་ཚངས་པ་རིན་ཆེན་ཕྲེང་བ་འཆང་ཞེས་བྱ་བ་དང་། ཚངས་པ་ཐོར་ཚུགས་འཆང་ཞེས་བྱ་བ་དང་། ཚངས་པ་གཞོན་ནུ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་རྫུ་འཕྲུལ་ཆེན་པོས་རྒྱལ་པོའི་ཁབ་དང་བཅས། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་དང་བཅས། འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་དང་བཅས་པ་ཐམས་ཅད་མཛེས་པར་བྱས་ཏེ།
en: At that time, there were also hundreds of thousands of Brahmā youths such as Jewel Garland-Bearing Brahmā and Topknot-Bearing Brahmā. Through their great supernormal powers, they completely adorned the areas of Rājagṛha, Vulture Peak, and the Bamboo Grove of Kalandaka.

source: ཁོར་ཡུག་ཁེབས་པ་ཙམ་གྱི་མེ་ཏོག་སིལ་མ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ཏེ་སིལ་སྙན་རྣམས་བརྡུངས་ནས། ཙན་དན་གྱི་ཕྱེ་མ་དང་། བྱུག་པ་དག་གིས་གཏོར་ཏེ།
en: Playing cymbals, they scattered flower blossoms over the Tathāgata, covering the entire area, and they then sprinkled sandalwood powder and various incenses.

source: རྒྱལ་པོའི་ཁབ་དང་བཅས། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་དང་བཅས། འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་དང་བཅས་པ། བསོད་ནམས་ཆེན་པོའི་ཞིང་དུ་གྱུར་པ། དཀྱིལ་འཁོར་ཆེན་པོ་མུ་སྟེགས་ཀྱི་གནས་སུ་གྱུར་པ། །ཁོ་ར་ཁོར་ཡུག་ཏུ་ལ་བ་དང་། རས་དང་། ཟབ་དར་དང་། ཟར་མའི་རས་འཇམ་པོ་དང་། ལྷའི་གོས་ལྷའི་ཕྱེ་མས་བསྒོས་ཤིང་ཙན་དན་གྱིས་ཞེན་པར་བྱས་ནས་ལྷའི་བདུག་པས་བདུགས་པ་དག་བཏིང་སྟེ
en: All around the great fields of merit—the areas of Rājagṛha, Vulture Peak, and the Bamboo Grove of Kalandaka—and all the great lands that are the abodes of non-Buddhists, divine garments of wool, cotton, silk, and fine linen, which were perfumed by divine powder, beautified with sandalwood, and fumigated with divine incense, were conjured and arranged in a circle.

source: མངོན་པར་སྤྲུལ་པ་བཞིན་དུ་བྱས་ནས་མེ་ཏོག་གི་ཆར་མངོན་པར་ཕབ་ནས་ལྷའི་རིན་པོ་ཆེ་དུ་མས་ཡོངས་སུ་མཛེས་པར་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སེང་གེའི་ཁྲི་འབུམ་བཤམས་ཏེ་ལན་ས་ཡ་ཕྲག་གསུམ་བསྐོར་བ་བྱས་ནས་རང་རང་གི་བླ་གོས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ཏེ།
en: Letting fall a great shower of flowers, they set out a lion throne for the Bhagavān, adorned with various divine jewels, which they proceeded to circumambulate three million times. Afterward, they each removed their upper robes and arrayed them on the Bhagavān’s body.

source: ཡང་དེའི་ཚེ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་མོ་མངོན་པར་སྡུད་པ་ཞེས་བྱ་བ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་མོ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time there were also hundreds of thousands of goddesses, daughters of Māra, such as Māra’s daughter Fully Absorbing. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རྔ་ཡབ་དང་། རྨ་བྱའི་མདོངས་ལག་ན་ཐོགས་ཤིང་། ལྷའི་ཕེག་དང་། གླིང་བུ་དང་། བདུག་པ་ཐོགས་ཏེ། ལྷའི་མེ་ཏོག་སིལ་མས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ནས་སིལ་སྙན་རྣམས་བརྡུངས་ཏེ་གར་བྱེད་ཅིང་གླུ་ལེན་ནོ། །
en: Having arrived, holding aloft whisks and peacock’s eye feathers, small divine cymbals, flutes, and incense, they scattered divine flower blossoms on the Tathāgata. They then played their cymbals, dancing and singing.

source: ལྷ་མོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་སེམས་དད་ཅིང་རབ་ཏུ་དགའ་བ། ཐེག་པ་ཆེན་པོ་ལ་དད་ཅིང་ཡིད་དགེ་བར་གྱུར་པ་ཤ་སྟག་སྟེ།
en: These goddesses were all filled with devotion and delight toward the Great Vehicle, desiring and favoring only the Great Vehicle.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They went to where the Bhagavān was staying and, joining their palms, circumambulated the Bhagavān three times and sat down to one side.

source: ཡང་དེའི་ཚེ་ལྷའི་བུ་མོ་ཆུ་ཤིང་ལྟ་བུ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལྷའི་བུ་མོ་འབུམ་ཕྲག་དུ་མ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of apsarases, such as the apsaras Like a Plantain Tree. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། ལྷའི་གསེར་གྱི་ཙོང་ཙོང་དང་། ལྷའི་རིན་པོ་ཆེའི་ཕྲེང་བ་དང་། ལྷའི་མེ་ཏོག་གི་ཕྲེང་བ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ཏེ་
en: Having arrived, they scattered divine gold, divine jewel garlands, and divine flower garlands over the Tathāgata.

source: སིལ་སྙན་རྣམས་བརྡུངས་ནས་ཙན་དན་གྱི་ཕྱེ་མ་དང་བྱུག་པ་དག་གིས་ཀྱང་གཏོར་ཏོ། །
en: Then, playing cymbals, they scattered sandalwood powder and various incenses.

source: ལྷའི་བུ་མོ་དེ་དག་ཐམས་ཅད་ཀྱང་བུད་མེད་ཀྱི་སེམས་ཀྱི་གཡོ་སྒྱུའི་རང་བཞིན་དང་བྲལ་བ།
en: These apsarases were all freed from the cunning nature of a woman’s mind.

source: ཐེག་པ་ཆེན་པོ་ལ་སེམས་དད་ཅིང་རབ་ཏུ་དགའ་བ། ཐེག་པ་ཆེན་པོ་ལ་དད་ཅིང་ཡིད་དགེ་བར་གྱུར་པ་ཤ་སྟག་སྟེ།
en: They all possessed devotion and delight toward the Great Vehicle, desiring and favoring only the Great Vehicle.

source: གླུ་ལེན་ཅིང་གར་བྱེད་ལ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས།
en: Singing and dancing, they all prostrated, touching their heads to the Bhagavān’s feet, and circumambulated him three times.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ཉིད་ཀྱི་ཚེ་ལྗོངས་ཀྱི་ཕྱོགས་དག་ན་དགེ་སློང་ཇི་སྙེད་གནས་ཤིང་འཁོད་པ་དེ་དག་ཐམས་ཅད་རྒྱལ་པོའི་ཁབ་དང་། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དེར་འདོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་དོ། །
en: Then, at that very time, the Bhagavān, fully manifesting his supernormal powers, caused all the bhikṣus in all the directions of the land to go to Vulture Peak in Rājagṛha.

source: དེར་ཕྱིན་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they went to where the Bhagavān was staying and, joining their palms, circumambulated the Bhagavān three times and sat down to one side.

source: ཡང་དེའི་ཚེ་ནམ་མཁའ་ལས་སིལ་སྙན་སྟོང་གི་གླུ་དབྱངས་ལྟ་བུ་འཐུན་པ་དང་མི་འཐུན་པའི་སྒྲ་མངོན་པར་གྲག་སྟེ།
en: At that time, there were also harmonious and disharmonious sounds, like the melodies of a thousand cymbals, clearly resounding from the depths of empty space.

source: སྟང་ཟིལ་གྱི་རི་ལྟ་བུར་འདུག་པའི་སྤྲིན་ཆེན་པོའི་ཚོགས་ལྷའི་རིན་པོ་ཆེའི་ཆུས་ཡོངས་སུ་རྒྱས་པ་དག་ཀྱང་། བཅོམ་ལྡན་འདས་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་ཤིང་ཆོས་སྟོན་པ་མནོད་པའི་ཕྱིར་སྡོད་དོ། །
en: A mass of great clouds, black like mountains of obsidian, rained down divine jewels, pervading and purifying everything everywhere, thundering the lion’s roar of the Bhagavān and extolling the virtues of receiving the Dharma teachings.

source: ཡང་དེའི་ཚེ་རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་ལྟ་སྟེ། རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་འཐོར་རླུང་ཞེས་བྱ་བ་དང་། རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་འཐོར་རླུང་ཆེན་པོ་ཞེས་བྱ་བ་དང་། རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་ཤུགས་མ་ཉམས་པ་ཞེས་བྱ་བ་དང་། རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་འཇིགས་བྱེད་ཆེན་པོ་ཞེས་བྱ་བ་རྣམས་ལྷའི་བདེ་བའི་ལོངས་སྤྱོད་དང་།
en: At that time, there were also the four great wind kings: the great wind king Scattering Wind, the great wind king Great Scattering Wind, the great wind king Unflagging Force, and the great wind king Great Terrifier.

source: ཡོངས་སུ་སྤྱོད་པའི་དུས་ཚིགས་དྲུག་གི་བདེ་ཞིང་བསིལ་བའི་མེ་ཏོག་དང་རྣམ་པར་འདྲེས་པའི་དྲི་བསུང་ཞིམ་པོའི་ངད་གཏོང་ཞིང་།
en: They all emitted pleasing, enjoyable, cooling flowers from the six seasons and a mixture of sweet fragrances and were endowed with the enjoyments of divine bliss.

source: རླུང་གི་རྒྱལ་པོ་ཆེན་པོ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་སྤྲིན་ཆེན་པོ་རབ་ཏུ་འགྱེད་དེབཅོམ་ལྡན་འདས་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་ཤིང་ཆོས་སྟོན་པ་མནོད་པའི་ཕྱིར་སྟོད་དོ།། །།
en: To show reverence to the Bhagavān, these great wind kings produced great clouds that thundered the lion’s roar of the Bhagavān and extolled the virtues of receiving the Dharma teachings.

source: ཡང་དེའི་ཚེ་ངང་པའི་རྒྱལ་པོ་སེང་གེ་ལྟར་དཔའ་བ་ཞེས་བྱ་བ་ངང་པ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of geese, including the goose king Lion-Like Hero. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet.

source: སློབ་དཔོན་དང་སློབ་མས་ལེགས་པར་བསྒྲུབས་པའི་སིལ་སྙན་སྟོང་གི་གླུ་དབྱངས་ལྟ་བུར་སྐད་འཐུན་པར་འབྱིན་ཅིང་།
en: They then let loose a harmonious cry like the melody of a thousand well-made cymbals crafted by masters and their disciples.

source: ངང་པའི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་
en: To show their reverence for the Bhagavān, the entire assembly of geese circumambulated him three times.

source: འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་རྨ་བྱའི་རྒྱལ་པོ་བལྟ་ན་འོད་ཆགས་ཞེས་བྱ་བ་རྨ་བྱའི་རིགས་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Also, at that time, there were hundreds of thousands of peacocks, including the peacock king Radiant Appearance. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལྷ་དང་། དྲི་ཟའི་སློབ་དཔོན་དང་སློབ་མས་ལེགས་པར་བསྒྲུབས་པའི་སིལ་སྙན་སྟོང་གི་གླུ་དབྱངས་ལྟ་བུར་མགྲིན་པ་བལྟམས་ཏེ་སྐད་སྙན་ཅིང་འཐུན་པ་འབྱིན་ཏེ
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet. Then, filling their throats, they issued a harmonious cry like the melody of a thousand well-made cymbals crafted by gandharva masters and their disciples.

source: རྨ་བྱའི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: To show their reverence for the Bhagavān, the entire assembly of peacocks circumambulated him three times. Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་ཁུ་བྱུག་གི་རྒྱལ་པོ་སྡེ་བདག་ཅེས་བྱ་བ་ཁུ་བྱུག་གི་རྒྱལ་པོ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of cuckoos, including the cuckoo king Leader. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet.

source: སིལ་སྙན་སྟོང་དང་འདྲ་བའི་སྒྲ་ཕྱུང་སྟེ་ཅ་ཅོའི་སྒྲ་བཏོན་ནས། བུང་བའི་མདོག་འདྲ་བའི་ཁུ་བྱུག་གི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Then they let out a cry like the sound of a thousand cymbals, producing a cacophonous roar. To show their reverence for the Bhagavān, the entire assembly of cuckoos, colored like bees, circumambulated him three times. Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་གངས་ཀྱི་རི་ལ་གནས་པའི་བྱ་ཀ་ལ་པིང་ཀའི་རྒྱལ་པོ་པད་མའི་འདབ་མ་འདྲ་བའི་མིག་ཅེས་བྱ་བ་བྱ་ཀ་ལ་པིང་ཀའི་རྒྱལ་པོ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of kalaviṅka kings who made their homes in the snowy mountains, including the kalaviṅka king Lotus-Like Eyes. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེབཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཡིད་དུ་འོང་བའི་སྒྲ་ཕྱུང་སྟེ།
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet.

source: ཀ་ལ་པིང་ཀའི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Then, to show their reverence for the Bhagavān, the entire assembly of kalaviṅka birds circumambulated him three times while making beautiful sounds. Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་བྱའི་རྒྱལ་པོ་ཤང་ཤང་ཏེའུ་ཞེས་བྱ་བ་བྱའི་རྒྱལ་པོ་ཤང་ཤང་ཏེའུ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of bird kings called jīvañjīva. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཡིད་དུ་འོང་བའི་སྒྲ་ཕྱུང་སྟེ།
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet.

source: ཤང་ཤང་ཏེའུ་ཡི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Then, to show their reverence for the Bhagavān, the entire assembly of jīvañjīva birds circumambulated him three times while making beautiful sounds. Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་བྱའི་ཚོགས་ཐམས་ཅད་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there was also a great flock of birds who, after noon, set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་རང་རང་གི་འདབ་མ་ཐལ་མོའི་ཐབས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཡིད་དུ་འོང་བའི་སྒྲ་འབུམ་ཕྲག་དུ་མ་ཕྱུང་སྟེ། ནམ་མཁའི་དཀྱིལ་ཡོངས་སུ་གང་བར་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་
en: Having arrived there, they each joined their wings together like palms and prostrated to the Bhagavān, touching their heads to his feet. Then, to show their reverence for the Bhagavān, the entire assembly of birds circumambulated him three times.

source: ཡང་དེའི་ཚེ་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་ལྷ་རི་བཏང་བཟུང་དང་བཏང་བཟུང་ཆེན་པོའི་ལྷ་འབུམ་ཕྲག་དུ་མ་དང་། ལྷའི་བུ་འོད་ཆེན་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of mountain kings, including the god of Mount Meru and the gods of Mount Mucilinda and Great Mount Mucilinda, together with the devaputra Great Light. After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Having arrived there, they prostrated to the Bhagavān, touching their heads to his feet, and circumambulated him three times. Then they all took their places in the Bamboo Grove of Kalandaka.

source: ཡང་དེའི་ཚེ་གངས་ཀྱི་རི་ལ་གནས་པའི་སྨན་གྱི་ཚོགས་ཀྱི་ལྷ་མོ་རྣམས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, all the medicine goddesses residing in the snowy mountains set forth from their respective abodes after noon and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་
en: Having arrived there, they circumambulated the Bhagavān three times.

source: རིའི་མཆོག་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ལ་མཛེས་པར་འཁོད་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཕུང་པོའི་རི་དང་བཅས་པ་ཐམས་ཅད་སྣང་བར་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Then they adorned Vulture Peak, the most supreme of mountains, and entirely illuminated Rājagṛha and Vulture Peak, after which they all sat down to one side together.

source: ཡང་དེའི་ཚེ་རྔ་དང་། རྔ་བོ་ཆེ་དང་། ཅང་ཏེའུ་དང་། དུང་དང་། ལྕགས་ཀྱི་སིལ་ཁྲོལ་དང་། ཧི་ན་ཌི་མ་དང་། ཁར་རྔ་དང་། རྫ་རྔ་ཆེན་པོ་དང་། བལ་བི་ས་དང་། པི་བང་དང་། རྫ་རྔ་ཁ་གཅིག་པ་དང་། དྲིལ་བུ་དང་། གླིང་བུ་དང་། ཤུ་ཀ་དང་། ཤུ་ན་ལ་ལ་སོགས་པ་མ་བརྡུངས། མ་བཅོས། མ་བླངས་པར་སིལ་སྙན་གྱི་སྒྲ་དང་། ཡིད་དུ་འོང་བའི་སྒྲ་བྱུང་ངོ་། །
en: At that time, there arose the beautiful, uncreated, unplayed musical sounds of drums, great drums, hand drums, conch horns, iron cymbals, hinḍima,#10 gongs, great kettledrums, balbisa,#11 lutes, one-sided kettledrums, bells, flutes, whistles, shunala,#12 and other instruments.

source: ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་ནགས་རྣམས་དུས་མ་ཡིན་པར་མེ་ཏོག་རྒྱས་ཤིང་། དུས་མ་ཡིན་པར་འབྲས་བུ་དང་། ལྕུག་ཕྲན་དང་། དོག་པ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་རྒྱས་པས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་ཤིན་ཏུ་བཀྲམ་མོ། །
en: At that time, out of reverence for the Bhagavān, a variety of flowers, fruits, shoots, and anthers blossomed forth unseasonably on all the trees, spreading all over Vulture Peak.

source: ཡང་དེའི་ཚེ་གངས་ཀྱི་རི་ལ་གནས་པའི་སེང་གེའི་རྒྱལ་པོ་རིན་ཆེན་པད་མ་ཞེས་བྱ་བ་སེང་གེའི་རྒྱལ་པོ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of lion kings residing in the snowy mountains, such as the lion king Precious Lotus. After noon, they set forth from their respective abodes and went to where the Bhagavān was staying.

source: གཅན་གཟན་དང་རི་དགས་ཐམས་ཅད་ལ་བདེ་བའི་སྒྲ་སེང་གེའི་སྐད་འབྱིན་ཅིང་འཆག་ལ་ཤིན་ཏུ་རྩེ་སྟེ།
en: They let forth their lion’s roar, which was pleasing to all the wild animals that were frolicking about.

source: བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: Then, to show their reverence for the Bhagavān, they all circumambulated him three times. Then they all took their places on Vulture Peak.

source: ཡང་དེའི་ཚེ་སྤོས་ཀྱི་གླང་པོའི་རྒྱལ་པོ་རི་བོ་དང་སྤྲིན་ལྟ་བུ་ཞེས་བྱ་བ་དང་། སྤོས་ཀྱི་གླང་པོའི་རྒྱལ་པོ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of mighty elephant kings, such as the mighty elephant king Mountaintop Cloud. After noon, they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་
en: Having arrived there, they prostrated to the Bhagavān, touching their heads to his feet.

source: འབྲུག་སྒྲ་ཆེན་པོ་བཞིན་དུ་སྒྲོགས་ཤིང་སྐད་བྱུང་ནས། བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: They let forth a great roar, like the sound of thunder, and, to show their reverence for the Bhagavān, they all proceeded to circumambulate him three times. Then they all took their places on Vulture Peak.

source: དེ་བཞིན་དུ་གཅན་གཟན་དང་རི་དགས་ཐམས་ཅད་ཀྱི་བར་དག་གིས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིའི་ཕྱོགས་གཅིག་ཏུ་གོ་བཟུང་ངོ་། །
en: In the same fashion, all wild animals took their places on Vulture Peak.

source: ཡང་དེའི་ཚེ་ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། ཆུ་སྲིན་དང་། ཉ་དང་། རུ་སྦལ་དང་། སྡིག་པ་དང་། སྲིན་གྱི་མེ་དང་། པ་ར་སུ་མི་ཀ་དང་། ཙུ་ན་ཙུ་ཀ་དང་། ས་རི་ཀ་དང་། སྲོག་ཆགས་གདུག་པའི་རིགས་རྣམས་ཀྱིས་དུག་རྣམ་པར་སྤངས་ནས་དུག་གི་རང་བཞིན་དང་བྲལ་བར་གྱུར་ཏེ་འཁོད་དོ། །
en: At that time, all venomous creatures, such as horseflies, winged insects, water monsters, fish, tortoises, scorpions, and venomous bugs, abandoned their poisons and settled down, free from the nature of poison.

source: ཡང་དེའི་ཚེ་སྦྲུལ་དང་། མྱུར་དུ་གདུག་པ་དང་། སྦྲུལ་གཟི་གུ་དང་། ཆུ་སྦྲུལ་དང་། གདུག་པ་མི་བཟད་པ་ཆེན་པོའི་རིགས་རྣམས་ཀྱིས་དུག་རྣམ་པར་སྤངས་ནས་དུག་གི་རང་བཞིན་དང་བྲལ་བར་གྱུར་ཏེ་འཁོད་དོ། །
en: At that time, all strongly venomous creatures, such as snakes, swift and malevolent snakes, albino snakes, and water snakes, abandoned their poisons and settled down, free from the nature of poison.

source: ཡང་དེའི་ཚེ་ནད་བཞི་བརྒྱ་རྩ་བཞིས་ཐེབས་པའི་སེམས་ཅན་གང་སུའང་རུང་བ་དག་དང་། ཡི་དགས་སུ་གྱུར་པ་གང་ཡིན་པ་དག་དང་། སེམས་ཅན་དམྱལ་བའི་སྐྱེ་གནས་སུ་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཟས་དང་སྐོམ་གྱིས་ཚིམ་པར་གྱུར་ཏེབདེ་བ་དང་བསིལ་བའི་རླུང་གིས་ཕོག་ནས་གཉིད་འོང་ཞིང་མངོན་པར་རྩེ་བར་གྱུར་ཏོ། །
en: At that time, all sentient beings who had been struck by the four hundred and four diseases, all pretas, and all sentient beings born within the hell realms were given food and drink to satiate them, after which, touched by a pleasing and cooling breeze, they fell into a deep and enjoyable sleep.

source: ཡང་དེའི་ཚེ་ལས་མི་ཟད་པ་རྣམ་པ་བཅུ་དྲུག་གིས་འཚོ་བའི་སེམས་ཅན་རྣམས་ཀྱིས་ལས་མི་ཟད་པའི་རང་བཞིན་བཏང་ནས་
en: At that time, all sentient beings who made their living by means of the sixteen great inexpiable occupations gave up the underlying nature of these inexpiable occupations.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཟས་དང་སྐོམ་གྱིས་ཚིམ་པར་གྱུར་ཏེབདེ་བ་དང་བསིལ་བའི་རླུང་གིས་ཕོག་ནས། གཉིད་འོང་ཞིང་མངོན་པར་རྩེ་བར་གྱུར་ཏོ། །
en: Then, they were all given food and drink to content them, after which, touched by a pleasing and cooling breeze, they fell into a deep and enjoyable sleep.

source: ཤ་ཟ་ཞིང་སྲིན་པོའི་རང་བཞིན་ལྟ་བུར་གྱུར་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤ་ཟ་བ་སྤངས་ཏེ་ཇི་སྲིད་འཚོའི་བར་དུ་ཚུལ་ཁྲིམས་བླངས་སོ། །
en: All sentient beings with natures like piśācas and rākṣasas renounced meat eating and vowed to take up ethical discipline for the rest of their lives.

source: ཡང་དེའི་ཚེ་སེམས་ཅན་གང་དག་བྱི་བོ་བྱེད་པ་དང་། རྐུ་འཕྲོག་ལ་ཞུགས་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཚུལ་ཁྲིམས་བླངས་ཏེ་དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ལ་དགའ་བར་གྱུར་ཏོ། །
en: At that time, all sentient beings who had engaged in sexual misconduct or committed thievery took up and were tamed by ethical discipline, rejoicing in the practice of correct restraint.

source: དེ་ནས་ལས་མི་ཟད་པ་ཆེན་པོ་བཅུ་དྲུག་གིས་འཚོ་བ་དང་། ཤ་ཟ་དང་། བྱི་བོ་བྱེད་པ་དང་། མ་བྱིན་པར་ལེན་པ་ལ་ཞུགས་པའི་སེམས་ཅན་དེ་དག་གིས་རང་རང་གི་སེམས་རྗེས་སུ་དྲན་ནས་གར་བྱེད་ཅིང་གླུ་ལེན་ཏེ་སྲི་ཞུ་བྱ་བར་བརྩམས་སོ། །
en: Then, all those sentient beings who had engaged in the sixteen great inexpiable occupations, meat eating, sexual misconduct, and thievery engaged in mindful recollection. Afterward, they gathered to pay reverence, dancing and singing.

source: ཡང་དེའི་ཚེ་དེ་དག་དང་གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དང་། འབྱུང་པོ་དང་། གཅོད་བྱེད་ཀྱི་བུ་དང་། བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་དང་། ཚངས་པ་དང་། ནགས་ཀྱི་ལྷ་དང་། བྱ་དང་། རིག་སྔགས་འཆང་དང་། འདོད་དགུར་བསྒྱུར་བའི་གཟུགས་ཅན་གྱི་ལྷ་མོའི་ཚོགས་དུ་མ་དག་ཀྱང་ཆོས་ཀྱི་འདུ་སྟོན་གྱི་མཆོག་གི་དཀྱིལ་འཁོར་ཆེན་པོ་ཐོས་ཏེ
en: At that time, all those beings, together with all the assemblies of other gods, nāgas, yakṣas, garuḍas, kinnaras, mahoragas, gandharvas, asuras, rākṣasas, kumbhāṇḍas, bhūtas, pretas, Śakra, the world guardians, Brahmā, forest gods, vidyādharas, and the goddesses endowed with all desirable forms, listened to the great, supreme wheel of the collected Dharma teachings.

source: རབ་ཏུ་དགའ་བར་གྱུར་ནས་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་ཅིང་ཐེག་པ་ཆེན་པོ་རྒྱས་པར་བྱ་བར་འདོད་པ། མཚུངས་པ་མེད་པའི་མདོ་ཆེན་པོའི་བསྒྲུབ་པ་གཟུང་བར་འདོད་པ།
en: Overjoyed, they wished to perfectly maintain pure discipline and to spread the Great Vehicle far and wide by realizing and upholding its great, unparalleled discourses.
